Ran Plan for project: `platform` dir: `2.platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.infisical is tainted, so must be replaced
-/+ resource "helm_release" "infisical" {
      ~ id                         = "infisical" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "1.0.1"
              - chart          = "infisical-standalone"
              - first_deployed = 1765257578
              - last_deployed  = 1765257578
              - name           = "infisical"
              - namespace      = "security"
              - notes          = <<-EOT
                    CHART NAME: redis
                    CHART VERSION: 18.14.1
                    APP VERSION: 7.2.4
                    
                    ** Please be patient while the chart is being deployed **
                    
                    Redis&reg; can be accessed via port 6379 on the following DNS name from within your cluster:
                    
                        redis-master.security.svc.cluster.local
                    
                    
                    
                    To connect to your Redis&reg; server:
                    
                    1. Run a Redis&reg; pod that you can use as a client:
                    
                       kubectl run --namespace security redis-client --restart='Never'  --image mirror.gcr.io/bitnamilegacy/redis:7.2.4-debian-11-r18 --command -- sleep infinity
                    
                       Use the following command to attach to the pod:
                    
                       kubectl exec --tty -i redis-client \
                       --namespace security -- bash
                    
                    2. Connect using the Redis&reg; CLI:
                       redis-cli -h redis-master
                    
                    To connect to your database from outside the cluster execute the following commands:
                    
                        kubectl port-forward --namespace security svc/redis-master 6379:6379 &
                        redis-cli -h 127.0.0.1 -p 6379
                    
                    WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
                      - master.resources
                      - replica.resources
                    +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
                    
                    The ingress-nginx controller has been installed.
                    It may take a few minutes for the LoadBalancer IP to be available.
                    You can watch the status by running 'kubectl --namespace security get services -o wide -w infisical-ingress-nginx-controller'
                    
                    An example Ingress that makes use of the controller:
                      apiVersion: networking.k8s.io/v1
                      kind: Ingress
                      metadata:
                        name: example
                        namespace: foo
                      spec:
                        ingressClassName: nginx
                        rules:
                          - host: www.example.com
                            http:
                              paths:
                                - backend:
                                    service:
                                      name: exampleService
                                      port:
                                        number: 80
                                  path: /
                        # This section is only required if TLS is to be enabled for the Ingress
                        tls:
                          - hosts:
                            - www.example.com
                            secretName: example-tls
                    
                    If TLS is enabled for the Ingress, a Secret containing the certificate and key must also be provided:
                    
                      apiVersion: v1
                      kind: Secret
                      metadata:
                        name: example-tls
                        namespace: foo
                      data:
                        tls.crt: <base64 encoded cert>
                        tls.key: <base64 encoded key>
                      type: kubernetes.io/tls
                    
                    ##
                    
                    -- Infisical Helm Chart --
                    
                    ██╗███╗   ██╗███████╗██╗███████╗██╗ ██████╗ █████╗ ██╗     
                    ██║████╗  ██║██╔════╝██║██╔════╝██║██╔════╝██╔══██╗██║     
                    ██║██╔██╗ ██║█████╗  ██║███████╗██║██║     ███████║██║     
                    ██║██║╚██╗██║██╔══╝  ██║╚════██║██║██║     ██╔══██║██║     
                    ██║██║ ╚████║██║     ██║███████║██║╚██████╗██║  ██║███████╗
                    ╚═╝╚═╝  ╚═══╝╚═╝     ╚═╝╚══════╝╚═╝ ╚═════╝╚═╝  ╚═╝╚══════╝
                    infisical-standalone (1.7.2)
                    
                    
                    ╭―― Thank you for installing Infisical! 👋  ―――――――――――――――――――――――――――――――――――――――――――――――――――――――――――┤
                    │
                    │   Infisical / All-in-one open-source SecretOps solution to manage your secrets across your infra! 🔒🔑
                    │
                    │   Visit < https://infisical.com/docs/self-hosting/overview > for further documentation about self-hosting!
                    │
                    │   Current installation (infisical) :
                    │   • infisical          : true
                    |   • nginx              : true
                    |   • Postgres DB        : false
                    |   • Redis              : true
                    │
                    ╰―――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――┤
                    
                    ――― Here's a list of helpful commands to get you started 📝  ―――――――――――――――――――――――――――――――――――――――――┤
                    
                    → Get all the Infisical resources (excluding secrets/pvcs)
                    $ kubectl get all -n security
                     
                    → Get your release status
                    $ helm status -n security infisical
                    
                    → Get your release resources
                    $ helm get all -n security infisical
                    
                    → Uninstall your release
                    $ helm uninstall -n security infisical
                     
                    ――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――┤
                    
                    ##
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - controller    = {
                          - replicas = 1
                        }
                      - image         = {
                          - repository = "infisical/infisical"
                          - tag        = "v0.92.0-postgres"
                        }
                      - infisical     = {
                          - image = {
                              - repository = "infisical/infisical"
                              - tag        = "v0.92.0-postgres"
                            }
                        }
                      - ingress       = {
                          - enabled = false
                        }
                      - kubeSecretRef = "infisical-secrets"
                      - postgresql    = {
                          - enabled = false
                        }
                      - redis         = {
                          - architecture = "standalone"
                          - auth         = {
                              - enabled = false
                            }
                          - enabled      = true
                        }
                      - resources     = {
                          - limits   = {
                              - cpu    = "1000m"
                              - memory = "1Gi"
                            }
                          - requests = {
                              - cpu    = "500m"
                              - memory = "512Mi"
                            }
                        }
                    }
                )
              - version        = "1.7.2"
            },
        ] -> (known after apply)
        name                       = "infisical"
      ~ status                     = "failed" -> "deployed"
        # (26 unchanged attributes hidden)
    }

  # kubernetes_ingress_v1.infisical will be created
+ resource "kubernetes_ingress_v1" "infisical" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "cert-manager.io/cluster-issuer" = "letsencrypt-prod"
            }
          + generation       = (known after apply)
          + name             = "infisical-ingress"
          + namespace        = "security"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "traefik"

          + rule {
              + host = "i-secrets.truealpha.club"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "infisical-infisical-standalone-infisical"

                              + port {
                                  + number = 8080
                                }
                            }
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "i-secrets.truealpha.club",
                ]
              + secret_name = "infisical-tls"
            }
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://i-atlantis.truealpha.club/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>
Plan: 2 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`